# DividePerimeterZoneFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..DividePerimeterZoneFailed Property
BuiltInFailures..::..MassFailures Class See Also
---
Failed to divide perimeter zone.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividePerimeterZoneFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividePerimeterZoneFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividePerimeterZoneFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace